Revit 2026 API

# FailureMessageKey Properties

---

The FailureMessageKey type exposes the following members.

|  | Name | Description |
| --- | --- | --- |
|  | IsValidObject | Specifies whether the .NET object represents a valid Revit entity. |

#### Reference

FailureMessageKey Class

Autodesk.Revit.DB Namespace